In [ ]:
#Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [155]:
import numpy as np
import pandas as pd

In [156]:
def function1():
    n1 = pd.Series([10,20,30,40,50,60])
    print(n1)

In [157]:
function1()

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [158]:
#Q2. Write a Pandas program to convert a Panda module Series to Python list and it’s type.
def function2():
    n1 = pd.Series([5,10,15,20,25,30])
    print("the pandas module  is")
    print(n1)
    print(type(n1))
    
    print("the module series is")
    print(n1.tolist())
    print(type(n1.tolist()))

In [159]:
function2()

the pandas module  is
0     5
1    10
2    15
3    20
4    25
5    30
dtype: int64
<class 'pandas.core.series.Series'>
the module series is
[5, 10, 15, 20, 25, 30]
<class 'list'>

In [160]:
#Q3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.
# Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [161]:
def function3():
    n1=pd.Series([2,4,6,8,10])
    n2=pd.Series([1,3,5,7,9])
    print(f" N1={n1}")
    print(f"N2={n2}")
    print("*"*50)
    print(n1+n2)
    print("*"*50)
    print(n1-n2)
    print("*"*50)
    print(n1*n2)
    print("*"*50)
    print(n1/n2)
    print("*"*50)

In [162]:
function3()

 N1=0     2
1     4
2     6
3     8
4    10
dtype: int64
N2=0    1
1    3
2    5
3    7
4    9
dtype: int64
**************************************************
0     3
1     7
2    11
3    15
4    19
dtype: int64
**************************************************
0    1
1    1
2    1
3    1
4    1
dtype: int64
**************************************************
0     2
1    12
2    30
3    56
4    90
dtype: int64
**************************************************
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64
**************************************************

In [163]:
#Q4. Write a Pandas program to convert a dictionary to a Pandas series.

In [164]:
def function4():
    r1 = {'a':10, 'b':20, 'c':30,'d':40}
    print("original directory")
    print(r1)
    New_Series=pd.Series(r1)
    print("panda series")
    print(New_Series)

In [165]:
function4()

original directory
{'a': 10, 'b': 20, 'c': 30, 'd': 40}
panda series
a    10
b    20
c    30
d    40
dtype: int64

In [166]:
#Q5. Write a Pandas program to convert a NumPy array to a Pandas series.

In [167]:
def function5():
    n1 = np.array([5,10,15,20,25,30])
    print("the Numpy arry is ")
    print(n1)
    
    n2 = pd.Series(n1)
    print("converted in pandas")
    print(n2)

In [168]:
function5()

the Numpy arry is
[ 5 10 15 20 25 30]
converted in pandas
0     5
1    10
2    15
3    20
4    25
5    30
dtype: int64

In [169]:
#Q6. Write a Pandas program to change the data type of given a column or a Series.

In [170]:
def function6():
    s1= pd.Series(['100','200','Nikhil','300.15','400'])
    print("Original series:")
    print(s1)
    print("change the data type:")
    s2=pd.to_numeric(s1,errors='coerce')
    print(s2)

In [171]:
function6()

Original series:
0       100
1       200
2    Nikhil
3    300.15
4       400
dtype: object
change the data type:
0    100.00
1    200.00
2       NaN
3    300.15
4    400.00
dtype: float64

In [172]:
#Q7 Write a Pandas program to convert a given Series to an array.

In [173]:
def function7():
    s1= pd.Series(['100','200','500','300','400'])
    print("Original Series:")
    print(s1)
    print("Series array:")
    a=s1.values
    print(a)
    print(type(a))

In [174]:
function7()

Original Series:
0    100
1    200
2    500
3    300
4    400
dtype: object
Series array:
['100' '200' '500' '300' '400']
<class 'numpy.ndarray'>

In [175]:
#Q8. Write a Pandas program to create a dataframe from a dictionary and display it.

In [176]:
def function8():
    df = pd.read_csv('./50_Startups.csv')

funcation8()

In [177]:
df = pd.read_csv('./50_Startups.csv')

In [178]:
print(df)

          RnD  Administration  Marketing       State     Profit
0   165349.20       136897.80  471784.10    New York  192261.83
1   162597.70       151377.59  443898.53  California  191792.06
2   153441.51       101145.55  407934.54     Florida  191050.39
3   144372.41       118671.85  383199.62    New York  182901.99
4   142107.34        91391.77  366168.42     Florida  166187.94
5   131876.90        99814.71  362861.36    New York  156991.12
6   134615.46       147198.87  127716.82  California  156122.51
7   130298.13       145530.06  323876.68     Florida  155752.60
8   120542.52       148718.95  311613.29    New York  152211.77
9   123334.88       108679.17  304981.62  California  149759.96
10  101913.08       110594.11  229160.95     Florida  146121.95
11  100671.96        91790.61  249744.55  California  144259.40
12   93863.75       127320.38  249839.44     Florida  141585.52
13   91992.39       135495.07  252664.93  California  134307.35
14  119943.24       156547.42  256512.92     Florida  132602.65
15  114523.61       122616.84  261776.23    New York  129917.04
16   78013.11       121597.55  264346.06  California  126992.93
17   94657.16       145077.58  282574.31    New York  125370.37
18   91749.16       114175.79  294919.57     Florida  124266.90
19   86419.70       153514.11       0.00    New York  122776.86
20   76253.86       113867.30  298664.47  California  118474.03
21   78389.47       153773.43  299737.29    New York  111313.02
22   73994.56       122782.75  303319.26     Florida  110352.25
23   67532.53       105751.03  304768.73     Florida  108733.99
24   77044.01        99281.34  140574.81    New York  108552.04
25   64664.71       139553.16  137962.62  California  107404.34
26   75328.87       144135.98  134050.07     Florida  105733.54
27   72107.60       127864.55  353183.81    New York  105008.31
28   66051.52       182645.56  118148.20     Florida  103282.38
29   65605.48       153032.06  107138.38    New York  101004.64
30   61994.48       115641.28   91131.24     Florida   99937.59
31   61136.38       152701.92   88218.23    New York   97483.56
32   63408.86       129219.61   46085.25  California   97427.84
33   55493.95       103057.49  214634.81     Florida   96778.92
34   46426.07       157693.92  210797.67  California   96712.80
35   46014.02        85047.44  205517.64    New York   96479.51
36   28663.76       127056.21  201126.82     Florida   90708.19
37   44069.95        51283.14  197029.42  California   89949.14
38   20229.59        65947.93  185265.10    New York   81229.06
39   38558.51        82982.09  174999.30  California   81005.76
40   28754.33       118546.05  172795.67  California   78239.91
41   27892.92        84710.77  164470.71     Florida   77798.83
42   23640.93        96189.63  148001.11  California   71498.49
43   15505.73       127382.30   35534.17    New York   69758.98
44   22177.74       154806.14   28334.72  California   65200.33
45    1000.23       124153.04    1903.93    New York   64926.08
46    1315.46       115816.21  297114.46     Florida   49490.75
47       0.00       135426.92       0.00  California   42559.73
48     542.05        51743.15       0.00    New York   35673.41
49       0.00       116983.80   45173.06  California   14681.40

In [179]:
#Q9. i) Create a list of empids and names (10 employees).
 #  ii) Convert list into Series.
  # iii) Print type of Series.
  # iv) Convert Series into DataFrame.
 #  v) a) Display all records.
  #    b) Display first five records.
   #   c) Display last five records.
   #   d) Display first two and last two records.
  #    e) Display name of 5th employee.
  #    f) Display record of 4th employee.
  # vi) Save the record in csv file (MyRecord.csv)

In [180]:
#10. i) Read the MyRecord.csv file.
#    ii) Create a new column Salary

In [181]:
df = pd.read_csv('./Salary_Data.csv')

In [182]:
print(df)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [183]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [184]:
df['bonus'] = df['Salary'] * 0.10

In [185]:
print(df)

    YearsExperience  Salary    bonus
0               1.1   39343   3934.3
1               1.3   46205   4620.5
2               1.5   37731   3773.1
3               2.0   43525   4352.5
4               2.2   39891   3989.1
5               2.9   56642   5664.2
6               3.0   60150   6015.0
7               3.2   54445   5444.5
8               3.2   64445   6444.5
9               3.7   57189   5718.9
10              3.9   63218   6321.8
11              4.0   55794   5579.4
12              4.0   56957   5695.7
13              4.1   57081   5708.1
14              4.5   61111   6111.1
15              4.9   67938   6793.8
16              5.1   66029   6602.9
17              5.3   83088   8308.8
18              5.9   81363   8136.3
19              6.0   93940   9394.0
20              6.8   91738   9173.8
21              7.1   98273   9827.3
22              7.9  101302  10130.2
23              8.2  113812  11381.2
24              8.7  109431  10943.1
25              9.0  105582  10558.2
26              9.5  116969  11696.9
27              9.6  112635  11263.5
28             10.3  122391  12239.1
29             10.5  121872  12187.2
30             11.0  140000  14000.0
31             12.0  155000  15500.0
32             13.0  156000  15600.0

In [186]:
#Q11. Refer the dataset "Advertising.csv" and perform following tasks.
#i) Read the dataset "Advertising.csv" in data frame.

In [187]:
 df = pd.read_csv('./Advertising.csv')

In [188]:
    print(df)

        TV  radio  newspaper  sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

In [189]:
#2)Print first five records of dataset.

In [190]:
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [191]:
#iii) print last five records from dataset.

In [192]:
df.tail()

        TV  radio  newspaper  sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [193]:
#iv) display the columns inside the dataset.

In [194]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [195]:
#v) display last three records from dataset.

In [196]:
df.tail(3)

        TV  radio  newspaper  sales
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

In [197]:
#vi) display the information about the dataset and analyse the data.

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   radio      200 non-null    float64
 2   newspaper  200 non-null    float64
 3   sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

In [199]:
#vii) display types of each columns.

In [200]:
df.TV.dtype

dtype('float64')

In [201]:
df.radio.dtype

dtype('float64')

In [202]:
df.newspaper.dtype

dtype('float64')

In [203]:
df.sales.dtype

dtype('float64')

In [204]:
#viii) check for null values in the dataset and display the sum of null values inside the column.

In [205]:
df.isna().sum()

TV           0
radio        0
newspaper    0
sales        0
dtype: int64

In [206]:
#ix) drop a column 'radio' from a dataset and display first ten records.

In [207]:
df.drop(['radio'],axis=1)

        TV  newspaper  sales
0    230.1       69.2   22.1
1     44.5       45.1   10.4
2     17.2       69.3    9.3
3    151.5       58.5   18.5
4    180.8       58.4   12.9
..     ...        ...    ...
195   38.2       13.8    7.6
196   94.2        8.1    9.7
197  177.0        6.4   12.8
198  283.6       66.2   25.5
199  232.1        8.7   13.4

[200 rows x 3 columns]

In [208]:
#x) increase the sales by 10% and add a new column "updated_sales" in dataframe.

In [209]:
df.columns

Index(['TV', 'radio', 'newspaper', 'sales'], dtype='object')

In [210]:
df['update_sales'] = df['sales'] * 0.10

In [211]:
print(df)

        TV  radio  newspaper  sales  update_sales
0    230.1   37.8       69.2   22.1          2.21
1     44.5   39.3       45.1   10.4          1.04
2     17.2   45.9       69.3    9.3          0.93
3    151.5   41.3       58.5   18.5          1.85
4    180.8   10.8       58.4   12.9          1.29
..     ...    ...        ...    ...           ...
195   38.2    3.7       13.8    7.6          0.76
196   94.2    4.9        8.1    9.7          0.97
197  177.0    9.3        6.4   12.8          1.28
198  283.6   42.0       66.2   25.5          2.55
199  232.1    8.6        8.7   13.4          1.34

[200 rows x 5 columns]

In [212]:
#xi) display shape of data.

In [213]:
df= df.shape

In [214]:
print(df)

(200, 5)

In [215]:
#xiii)describe the dataset..

In [226]:
 df = pd.read_csv('./Advertising.csv')

In [228]:
df.describe()

               TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   14.022500
std     85.854236   14.846809   21.778621    5.217457
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   10.375000
50%    149.750000   22.900000   25.750000   12.900000
75%    218.825000   36.525000   45.100000   17.400000
max    296.400000   49.600000  114.000000   27.000000

In [ ]:
#12. Refer the dataset "Salaries.csv" and perform following tasks.

In [ ]:
#i) Read the dataset in dataframe.

In [230]:
df = pd.read_csv('./Salary_Data.csv')

In [231]:
print(df)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111
15              4.9   67938
16              5.1   66029
17              5.3   83088
18              5.9   81363
19              6.0   93940
20              6.8   91738
21              7.1   98273
22              7.9  101302
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [ ]:
#ii) display first five records.

In [232]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [ ]:
#iii) display first ten records.

In [233]:
df.head(10)

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891
5              2.9   56642
6              3.0   60150
7              3.2   54445
8              3.2   64445
9              3.7   57189

In [ ]:
#iii) display last five records.

In [234]:
df.tail()

    YearsExperience  Salary
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [235]:
df.tail(10)

    YearsExperience  Salary
23              8.2  113812
24              8.7  109431
25              9.0  105582
26              9.5  116969
27              9.6  112635
28             10.3  122391
29             10.5  121872
30             11.0  140000
31             12.0  155000
32             13.0  156000

In [ ]:
#vi) display the columns inside the dataset.

In [236]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [ ]:
#vii) display shape of data.

In [ ]:
#viii) describe the dataset.

In [260]:
df.shape

(33, 2)

In [251]:
df.describe()

       YearsExperience         Salary
count        33.000000      33.000000
mean          5.921212   82760.303030
std           3.342413   34014.620992
min           1.100000   37731.000000
25%           3.200000   56957.000000
50%           5.100000   67938.000000
75%           8.700000  109431.000000
max          13.000000  156000.000000

In [ ]:
#ix) display the information about the dataset and analyse the data.

In [252]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  33 non-null     float64
 1   Salary           33 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 656.0 bytes

In [ ]:
#x) display types of each columns.

In [253]:
df.YearsExperience.dtype

dtype('float64')

In [254]:
df.Salary.dtype

dtype('int64')